# (5)就業形態
EMPLOYMENT_TYPE_MAP = {
    "自営業主・家族従業者": 1,
    "正規の職員・従業員": 2,
    "派遣社員・契約社員等": 3,
    "パート・アルバイト": 4,
    "会社等の役員": 5,
#    "その他、就業状態詳細不明": 6,
    "その他": 6,
    "園児・生徒・学生など": 7,
    "専業主婦・主夫": 8,
    "無職": 9,
    "不明": 10
}

# (13)施設
FACILITY_MAP = {
    "住宅・寮": 1,
    "学校・保育・文化施設": 2,
    "医療施設": 3,
    "高齢福祉施設": 4,
    "公園・自然地・スポーツ施設等": 5,
    "その他の生活系施設": 6,
    "大規模小売店": 7,
    "小規模小売店": 8,
    "宿泊施設・ホテル": 9,
    "飲食施設": 10,
    "アミューズメント施設": 11,
    "その他の商業系施設": 12,
    "事務所・会社・銀行": 13,
    "官公庁施設": 14,
    "その他の業務系・工業系施設": 15,
    "不明": 16,
}

# (15)目的種類
PURPOSE_MAP = {
    "自宅－勤務": 1,
    "自宅－通学": 2,
    "自宅－業務": 3,
    "自宅－私事": 4,
    "帰宅": 5,
    "勤務・業務": 6,
    "私事": 7,
    "不明": 8,
}

# (17)代表交通手段（7区分）
MODE7_MAP = {
    "鉄道": 1,
    "バス": 2,
    "自動車": 3,
    "２輪車": 4,
    "自転車": 5,
    "徒歩": 6,
    "その他": 7,
    "不明": 8,
}

# (18)端末交通手段
MODE13_MAP = {
    "路線バス・コミュニティバス": 1,
    "高速バス": 2,
    "乗用車・軽自動車": 3,
    "貨物自動車・軽貨物車": 4,
    "レンタカー・カーシェアリング": 5,
    "自家用バス・貸切バス": 6,
    "タクシー・ハイヤー": 7,
    "バイク": 8,
    "レンタサイクル・コミュニティサイクル": 9,
    "自転車(個人所有)": 10,
    "徒歩(シニアカー含む)": 11,
    "その他": 12,
    "不明": 13
}

# (19)車種
VEHICLE_TYPE_MAP = {
    "乗用車・軽自動車": 1,
    "貨物自動車・軽貨物車": 2,
    "レンタカー・カーシェアリング": 3,
}

# (21)駐車場所
PARKING_LOCATION_MAP = {
    "パーキングメーター・パーキングチケット": 1,
    "月極の駐車場（道路外）": 2,
    "時間貸しの駐車場（道路外）": 3,
    "目的地の施設の駐車場（自宅を含む）": 4,
    "駅前広場内の駐車場所": 5,
    "駐車場は使わなかった": 6,
    "不明": 7,
}
